      ******************************************************************
      * Author: Jason Wilson <jason@wilsons.io>
      * Date: 04/17/2017
      * Purpose: Trying out the OpenCobolIDE 4.7.4
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-IDE.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY FUNCTION MODULE-ID.
            STOP RUN.
       END PROGRAM HELLO-IDE.
